[{
  "id": "um",
  "texto": "Joaquim Ferreira dos Santos  nasceu a 4 de outubro de 1782 na freguesia de Campanhã, no Porto, foi o quinto filho de um casal de agricultores. Apesar das suas origens humildes, conseguiu beneficiar de uma preparação escolar."
},
  {
    "id": "dois",
    "texto": "Em 1800, embarca para o Rio de Janeiro, Brasil, onde, com ajuda de um tio, começa a trabalhar com mercadorias em consignação. Aí casou-se com Severa Lastra, argentina de família abastada,\ncasamento que o ajudou na sua projeção como comerciante. A vida familiar não dura muito, o seu único filho morre cedo e rapidamente fica viúvo."
  },
  {
    "id": "tres",
    "texto": "Entre 1817 e 1829, Joaquim Ferreira dos Santos empreendeu um total de 42 viagens no triângulo Pernambuco-Luanda-Rio de Janeiro, usando dois dos seus próprios barcos, o Activo e o Tejo. Ao longo dos anos em que manteve esta\natividade, foi responsável pelo tráfico de mais de 10 mil pessoas escravizadas."
  },
  {
    "id": "quatro",
    "texto": "Com a independência do brasil a 1822, Joaquim Ferreira dos Santos opta pela nacionalidade brasileira."
  },
  {
    "id": "cinco",
    "texto": "Com a imposição da Lei Feijó, de 1831, que proibiu a importação de pessoas escravizadas para o Brasil, no ano seguinte Joaquim Ferreira dos Santos é acusado de continuar a traficar na ilegalidade. Para evitar consequências legais, regressa a Portugal nesse mesmo ano, em plena guerra civil, tendo-se fixado na cidade do Porto." },
  {
    "id": "seis",
    "texto": "Em 1842, renunciou à nacionalidade brasileira tendo readquirido a portuguesa. Neste ano, já com Costa Cabral na chefia do governo, ganhou proeminência no contexto político e financeiro do país, tendo financiado o Liberalismo português. Dominou grandes companhias por si criadas, sendo também acionista de muitas outras, entre elas instituições bancárias, incluindo o Banco de Portugal, e sociedades comerciais e de obras públicas."
  },
  {
    "id": "sete",
    "texto": "Pelas suas contribuições a favor do progresso social, político, comercial e financeiro do país, foram-lhe atribuídos os títulos nobiliárquicos de Barão, em 1842; de Visconde, em 1843; e de Conde, em 1850, passando a ser conhecido, a partir desta data, por Conde de Ferreira."
  },
  {
    "id": "oito",
    "texto": "Joaquim Ferreira dos Santos faleceu no Porto a 24 de março de 1866. Nove dias antes, tinha deixado lavrado o seu testamento."
  }]